{
  "basics": {
    "label": "Develop | Lead | Innovate",
    "characterClass": "Programmer",
    "website": "http://www.geoffreydagley.com",
    "phone": "469-742-1130",
    "email": "gdagley@gmail.com",
    "github": {
      "label": "LinkedIn: @gdagley",
      "flavor": "IM",
      "value": "https://linkedin.com/gdagley"
    },
    "other": [
      {
        "label": "Skype",
        "flavor": "IM",
        "value": "gdagley"
      }
    ],
    "name": "Geoffrey Dagley",
    "summary": "20+ years of experience developing for all aspects and scales of web and mobile applications, leading remote teams building massively distributed applications, and innovating with over 50 patents for new and upcoming ideas. Involved in all stages of the software development life cycle, both in startups and in enterprise environments, providing direction with new and emerging open source technologies",
    "picture": "bw_photo.jpg",
    "profiles": [
      {
        "network": "GitHub",
        "username": "gdagley",
        "url": "https://github.com/gdagley"
      },
      {
        "network": "Twitter",
        "username": "gdagley",
        "url": "https://twitter.com/gdagley"
      },
      {
        "network": "LinkedIn",
        "username": "gdagley",
        "url": "https://www.linkedin.com/in/gdagley"
      }
    ]
  },
  "work": [
    {
      "company": "Capital One",
      "website": "http://www.capitalone.com",
      "position": "Director, Software Engineering",
      "startDate": "2022-02",
      "summary": "",
      "highlights": [
        "Remotely managed multiple teams building and growing the Capital One Leads Navigator and Showroom products",
        "Developed self sufficient teams delivering new features, while keeping software and infrastructure up to Capital One's high standards",
        "Worked closely with product partners to define and prioritize product and technical initiatives",
        "Actively involved in the technical interviewing process, both as an interviewer and as a mentor to new interviewers"
      ]
    },
    {
      "company": "Capital One",
      "website": "http://www.capitalone.com",
      "position": "Sr Manager, Software Engineering",
      "startDate": "2020-02",
      "endDate": "2022-02",
      "summary": "",
      "highlights": [
        "Led team of 15 engineers through the acquisition of Carvoy.com",
        "Reimplemented Carvoy IP using the Capital One technology stack in 9 months",
        "Oversaw the technical growth of Leads Navigator to be used by over 3500 dealerships and $1B in originations"
      ]
    },
    {
      "company": "Capital One",
      "website": "http://www.capitalone.com",
      "position": "Lead Software Engineer",
      "startDate": "2017-07",
      "endDate": "2020-02",
      "summary": "",
      "highlights": [
        "Part of a research and development team exploring new technologies in financial services",
        "Developed proof-of-concept augmented reality iOS app that used machine learning to create a unique car buying experience. The app was shown off at SxSW 2018 and later released as the Capital One Auto Navigator app.",
        "Developed new ways to enhance the Auto Navigator search experience."
      ]
    },
    {
      "company": "Magic Leap",
      "website": "http://www.magicleap.com",
      "position": "Programmer",
      "startDate": "2016-04",
      "endDate": "2017-07",
      "summary": "",
      "highlights": [
        "Prototyped variety of XR experiences for the Magic Leap One",
        "Built prototyping tool to randomly generate rooms for testing AR experiences"
      ]
    },
    {
      "company": "FuzzyCube Software",
      "website": "http://www.fuzzycubesoftware.com",
      "position": "Programmer",
      "startDate": "2014-05",
      "endDate": "2016-04",
      "summary": "",
      "highlights": [
        "**Tap It Big** - Mobile game built with the Unity cross platform toolset and launched on iOS and Android.  *Launched: 11/2015*",
        "**Unreleased game** - Developed the backend services to support a cross platform game, including leaderboards, friends, IAP transactions using Ruby and the Grape micro-framework for creating REST-like APIs."
      ]
    },
    {
      "company": "Newtoy/Zynga With Friends",
      "website": "http://www.zynga.com",
      "position": "Lead, Backend Services",
      "startDate": "2010-05",
      "endDate": "2013-06",
      "summary": "",
      "highlights": [
        "Managed the remote team of developers that scaled the **With Friends Backend Service** using Ruby on Rails to support 10M+ daily users playing With Friends games (Words, Chess, Hanging, Gems, Scramble, Running, etc)",
        "Coordinated the migration of the **With Friends Backend Service** to two different data centers within a year due to the Zynga acquisition.  The actual switchover in data centers was accomplished with less than an hour downtime each and minimal disruption to players.",
        "Grew the **With Friends Backend Service** from initially supporting Chess and Words to being able to support any new With Friends style game that Zynga wanted to develop, i.e. Hanging, Scramble, Gems, Running With Friends.",
        "**Gems With Friends** - Developed the game client using the Cocos2d-x cross platform toolset",
        "**WeRule** - developed the backend service using Ruby on Rails to support the WeRule game for ngmoco https://en.wikipedia.org/wiki/We_Rul)"
      ]
    },
    {
      "company": "McKinney Station",
      "website": "http://www.geoffreydagley.com",
      "position": "Owner",
      "startDate": "2010-05",
      "endDate": "2013-06",
      "summary": "",
      "highlights": [
        "**Knowsys** - Updated a set of existing flash card apps for iOS while also providing Android versions of the apps using the cross platform Corona toolset. *Launched: 6/2014*",
        "**Dallasrb.org** – Co-organizer of the Dallas Ruby User Group from 2006 to 2011: coordinated speakers, maintained website, and facilitated community activities for Dallas Rubyists, such as the Ruby/ Open Spaces track at Dallas Techfest 2009.",
        "**StagingTracks.com** – Developed and deployed entire Ruby on Rails application to connect model railroaders with area clubs, local shops, and upcoming shows.  Receives 7500+ visitors a month.  *Launched: 10/2006*",
        "**ROOV.com** –  Built automated test suite using RSpec.  Provided development support during final push to deployment for Beta release.  *Launched: 1/2008*",
        "**7-R Ranch Internal Prospect Management application** – Migrated PHP based prospect management application to Ruby on Rails. Completely RSpec driven development with Selenium based functional tests for the browser.  *Launched: Internal Application*",
        "**WedgeTravel.com** – Developed a Ruby on Rails trip planner to compare the cost of driving, flying commercial, and chartering a flight.  Uses Google Maps for trip mapping and geocoding.  *Launched: 5/2007*",
        "**SchoolBates.com** – Applied look and feel from Photoshop mockups to a functioning Ruby on Rails application. Implemented various aspects of the navigation system and catalog.  *Launched: 6/2006*"
      ]
    },
    {
      "company": "Relevance, Inc.",
      "website": "http://www.thinkrelevance.com",
      "position": "Programmer",
      "startDate": "2007-06",
      "endDate": "2009-05",
      "summary": "",
      "highlights": [
        "**Community.TradeKing.com** –  One of two primary developers to build, test, deploy the community site for TradeKing.com.  Features included custom blog, forum, and feed reader engines to tie back to their trading platform.   *Launched: 10/2007*",
        "**21DayClub.com** – One of two primary developers to build a new product for Essi Systems.  The site includes tools for personal change management and personal assessments for evaluating.   *Launched: 1/2008*",
        "**Fizmo.com** – One of two primary developers to build an online classified system for radio stations in markets across the US.  The site included user submitted free and paid classified ads with attachment uploading.  *Launched: 6/2008*",
        "**PlaneStats.com** – One of two primary developers to build reporting and analysis application for the aviation industry.  The site used large amounts of freely available data from the Department of Transportation dating back to 1990, posing various database and application scaling situations. *Launched: 3/2009*"
      ]
    },
    {
      "company": "Southwest Airlines",
      "position": "Contract Software Developer",
      "startDate": "2006-06",
      "endDate": "2007-04",
      "summary": "",
      "highlights": [
        "Designed and implemented Refunds application business services for Service Oriented Architecture (SOA).",
        "Implemented Group Deposit business services for Service Oriented Architecture (SOA).",
        "Automate testing using JUnit to verify test cases defined in design documents, including using mock objects to test interfaces when component implementation did not exist.",
        "Create IDL (Interface Definition Language) to define business service definitions.  The IDL was then used to generate Java and C++ clients to communicate with the Java business service."
      ]
    },
    {
      "company": "EDS",
      "position": "Contract Software Developer",
      "startDate": "2005-11",
      "endDate": "2006-08",
      "summary": "",
      "highlights": [
        "Designed and implemented new web-based application for MCI for provisioning virtual trunks.",
        "Responsible for overall architecture of web-tier of application, including interaction with existing server architecture.",
        "Jump started a team of 5 developers that did not have any prior experience developing Java Struts web applications."
      ]
    },
    {
      "company": "Navigator Systems",
      "position": "Contract Software Developer",
      "startDate": "2005-08",
      "endDate": "2006-11",
      "summary": "",
      "highlights": [
        "Designed and implemented enhancements to web-based sales applications for FritoLay.",
        "Resolved existing defects and provided performance enhancements to the applications."
      ]
    },
    {
      "company": "ZMS Technologies, Inc.",
      "position": "Software Engineer",
      "startDate": "2004-11",
      "endDate": "2005-08",
      "summary": "",
      "highlights": [
        "Architected and implemented Java WebStart fleet planning solution for small businesses.",
        "Provided development environment which included: one step build-test-deploy process for development, continuous integration builds and nightly builds, bug tracking system, development wiki for documentation",
        "Researched and provided direction for technologies (Spring, Hibernate, WebStart) used in current development of transportation management software.",
        "Analyzed, maintained, and enhanced components for transportation management J2EE web application based on customer requirements."
      ]
    },
    {
      "company": "NextJet, Inc.",
      "position": "Software Engineer",
      "startDate": "2004-07",
      "endDate": "2004-10",
      "summary": "",
      "highlights": [
        "Analyzed, maintained, and enhanced components for J2EE web application based on customer bug reports and enhancement requests.",
        "*Note:* Company sold to UPS"
      ]
    },
    {
      "company": "Parago, Inc",
      "position": "Application Architect",
      "startDate": "2002-10",
      "endDate": "2004-06",
      "summary": "",
      "highlights": [
        "Analyzed and designed components for mission critical, enterprise wide J2EE web application.",
        "Lead a team of 5 developers in building a Check Fulfillment component.",
        "Developed web client interface based on discussions with the business owners",
        "Deployed and performance tuned the application on JBoss application server."
      ]
    },
    {
      "company": "Batky-Howell, Inc",
      "position": "Instructor",
      "startDate": "2001-05",
      "endDate": "2002-10",
      "summary": "",
      "highlights": [
        "Taught Java/ J2EE programming classes for variety of large customers including: Boeing, MCI Worldcom, Nielsen Media Research, Sprint",
        "Developed courseware for new and developing technologies, like SOAP and Web Services.",
        "Edited and revised courseware as versions of software became available, like J2EE 1.2 and Java 1.3."
      ]
    }
  ],
  "education": [
    {
      "institution": "Texas A&M University",
      "gpa": "3.4/4.0",
      "courses": [],
      "startDate": "1994-09",
      "endDate": "1998-05",
      "area": "Aerospace Engineering"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "keywords": [
        "Dart",
        "JavaScript",
        "Ruby",
        "Java",
        "Obj-C",
        "C#",
        "Python",
        "Lua",
        "SQL",
        "UML"
      ]
    },
    {
      "name": "Mobile",
      "level": "",
      "keywords": [
        "AWS Amplify",
        "Flutter",
        "iOS",
        "Android",
        "Unity",
        "Corona",
        "Ionic",
        "Rubymotion"
      ]
    },
    {
      "name": "Web",
      "level": "",
      "keywords": [
        "AWS Amplify",
        "React",
        "Ruby on Rails",
        "JQuery",
        "Angular",
        "HTML",
        "CSS"
      ]
    },
    {
      "name": "Java/J2EE",
      "level": "",
      "keywords": [
        "Android",
        "Java",
        "Spring"
      ]
    },
    {
      "name": "Databases",
      "level": "",
      "keywords": [
        "AWS DynamoDB",
        "Postgres",
        "MySql",
        "Redis",
        "memcache"
      ]
    },
    {
      "name": "OS",
      "level": "",
      "keywords": [
        "AWS",
        "Mac OS X",
        "iOS",
        "Android",
        "Windows",
        "Unix"
      ]
    }
  ]
}